[
   "When does it stop being partly cloudy and start being partly sunny?",
   "If a kid refuses to sleep during nap time, are they guilty of resisting a rest?",
   "If you are bald, what hair color do they put on your driver’s license?",
   "If God sneezes, what should you say?",
   "Is it still illegal to park next to a fire hydrant, even if your car is on fire?",
   "If a bunch of cats jumps on top of each other, is it still called a dog pile?",
   "If a baby’s leg pops out at 11:59 PM but his head doesn’t come out until 12:01, which day was he born on?",
   "Do Jewish vampires still avoid crosses?",
   "If a mime is arrested, do they tell him he has a right to talk?",
   "In the song Yankee Doodle, is he calling the horse or the feather “macaroni”?",
   "Is there a time limit on fortune cookie predictions?",
   "If vampires can’t see their reflections, why is their hair always so neat?",
   "If ghosts can walk through walls and glide down stairs, why don’t they fall through the floor?",
   "Is it legal to travel down a road in reverse, as long as your following the direction of the traffic?",
   "Why doesn’t the fattest man in the world become a hockey goalie?",
   "When Atheists go to court, do they have to swear on the bible?",
   "Is it rude for a deaf person to talk (sign) with their mouth full of food?",
   "If a doctor suddenly had a heart attack while doing surgery, would the other doctors work on the doctor or the patient?",
   "How can something be “new” and “improved”? if it’s new, what was it improving on?",
   "Why do they sterilize lethal injections?",
   "Why aren’t drapes double sided so it looks nice on the inside and outside of your home?",
   "Is a pessimist’s blood type B-negative?",
   "Why is it that when we “skate on thin ice”, we can “get in hot water”?",
   "If money doesn’t grow on trees then why do banks have branches?",
   "Why are the little styrofoam pieces called peanuts?",
   "If pro and con are opposites, wouldn’t the opposite of progress be congress?",
   "Is it possible to brush your teeth without wiggling your bottom?",
   "What do people in China call their good plates?",
   "Why does the sun lighten our hair, but darken our skin?",
   "Why can’t women put on mascara with their mouth closed?",
   "Why doesn’t glue stick to the inside of the bottle?",
   "Why don’t you ever see the headline Psychic Wins Lottery?",
   "Why does grape flavor smell the way it is when actual grapes don’t taste or smell anything like it.?",
   "Why does the Easter bunny carry eggs? Rabbits don’t lay eggs.",
   "Do Siamese twins pay for one ticket or two tickets when they go to movies and concerts?",
   "Why are they called ‘Jolly Ranchers’? Who said that the ranchers were jolly?",
   "Why do caregiver and caretaker mean the same thing?",
   "Can a short person “talk down” to a taller person?",
   "If a bald person works as a chef at a resaurant, do they have to wear a hairnet?",
   "If milk goes bad if not refrigerated, why does it not go bad inside the cow?",
   "What’s the difference between normal ketchup and fancy ketchup?",
   "Why can’t women put on mascara with their mouth closed?",
   "Why is abbreviated such a long word?",
   "Why is a boxing ring square?",
   "Why is it considered necessary to nail down the lid of a coffin?",
   "Why is it that doctors call what they do practice?",
   "Why is it that rain drops but snow falls?",
   "Who was the first person to look at a cow and say, ‘I think I’ll squeeze these dangly things here and drink whatever comes out’?",
   "Why do people point to their wrist when asking for the time, but don’t point to their crotch when they ask where the bathroom is?",
   "What do you call male ballerinas?",
   "Why is a person that handles your money called a ‘Broker’?",
   "If quizzes are quizzical, what are tests?",
   "Why doesn’t McDonald’s sell hotdogs?",
   "Are eyebrows considered facial hair?",
   "At a movie theater which arm rest is yours?",
   "If an ambulance is on its way to save someone, and it runs someone over, does it stop to help them?",
   "Do vegetarians eat animal crackers?",
   "Why are there no ‘B’ batteries?",
   "If a jogger runs at the speed of sound, can he still hear his iPod?",
   "If man evolved from monkeys, how come we still have monkeys?",
   "How do you handcuff a one-armed man?",
   "Do illiterate people get the full effect of Alphabet Soup?",
   "Why is it that to stop Windows you have to click on Start?",
   "Why is it that when you’re driving and looking for an address, you turn down the volume on the radio?",
   "Why is lemon juice made with artificial flavor and dishwashing liquid made with real lemons?",
   "Why is the man who invests all your money called a broker?",
   "Why is the third hand on the watch called a second hand?",
   "If corn oil is made from corn, and vegetable oil is made from vegetables, then what is baby oil made from?",
   "Why is vanilla ice cream white when vanilla extract is brown?",
   "Can animals commit suicide?",
   "Can you buy an entire chess set in a pawn shop?",
   "Why do people think that swaying their arm back and forth would change the direction of a bowling ball?",
   "What do you do when you see an endangered animal that is eating an endangered plant?",
   "If glassblowers inhale do they get a pane in the stomach?",
   "Why is it that when someone tells you that there are over a billion stars in the universe, you believe them, but if they tell you there is wet paint somewhere, you have to touch it to make sure?",
   "Why is the time of day with the slowest traffic called rush hour?",
   "Why isn’t there a special name for the tops of your feet?",
   "Why isn’t there mouse-flavored cat food?",
   "If you throw a cat out of the car window, does it become kitty litter?",
   "If you take an Asian person and spin him around several times does he become disoriented?",
   "Is it OK to use the AM radio after noon?",
   "You know that indestructible black box that is used on airplanes? Why don’t they make the whole plane out of it?",
   "If a firefighter fights fire and a crime fighter fights crime, what does a freedom fighter fight?",
   "If they squeeze olives to get olive oil, how do they get baby oil?",
   "If a cow laughs, does milk come out of her nose?",
   "If you are driving at the speed of light and you turn your headlights on, what happens?",
   "Why do they put Braille dots on the keypad of a drive-up ATM?",
   "What do people in China call their good plates?",
   "What do you call a male ladybug?",
  "What hair color do they put on the driver’s license of a bald man?",
   "Why do they sterilize the needle for lethal injections?",
   "Why do they call it a pair of pants, but only 1 bra?",
   "Why is it called tourist season if we can’t shoot at them?",
   "Why do you need a driver’s license to buy liquor when you can’t drink and drive?",
   "Why isn’t phonetic spelled the way it sounds?",
   "Why are there Interstates in Hawaii?",
   "Why are there flotation devices in the seats of planes instead of parachutes?",
   "Why are cigarettes sold at gas stations where smoking is prohibited?",
   "Have you ever imagined the world without hypothetical situations?",
   "How does the guy who drives the snowplow get to work?",
   "If the 7-11 is open 24 hours a day, days a year, why does it have locks on the door?",
   "Why is it that when you transport something by car it is called shipment, but when you transport something by ship it’s called cargo?",
   "Why don’t sheep shrink when it rains?",
   "Why are they called apartments when they are all stuck together?",
   "If con is the opposite of pro, is Congress the opposite of progress?",
   "If flying is so safe, why do they call the airport the terminal?",
   "Since bread is square, then why is sandwich meat round?",
   "Do they have the word “dictionary” in the dictionary?",
   "Why is it that everyone driving faster than you is considered an idiot and everyone driving slower than you is a moron?",
   "Can you daydream at night?",
   "Why do they call the little candy bars “fun sizes”. Wouldn’t it be more fun to eat a big one?",
   "What is Satan’s last name?",
   "What is a picture of a thousand words worth?",
   "Why does quicksand work slowly?",
   "Can crop circles be square?",
   "Why is it called Alcoholics Anonymous when the first thing you do is stand up and say, ‘My name is Bob, and I am an alcoholic’?",
   "Why is there a light in the fridge and not in the freezer?",
   "Why does mineral water that ‘has trickled through mountains for centuries’ have a ‘use by’ date?",
   "Why do toasters always have a setting that burns the toast to a horrible crisp no one would eat?",
   "Is French kissing in France just called kissing"
]
